# Cable Type Get Usable Cable Size Ids Method

Source: https://www.revitapidocs.com/2026/9a1cfa5b-601f-285f-e2c6-a009e1e0c922.htm

---

| Cable Type Get Usable Cable Size Ids Method |
| --- |

Gets all the Cable Sizes that can be used by this Cable Type, sorted by name.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IList<ElementId> GetUsableCableSizeIds()
```

```
Public Function GetUsableCableSizeIds As IList(Of ElementId)
```

```
public:
IList<ElementId^>^ GetUsableCableSizeIds()
```

```
member GetUsableCableSizeIds : unit -> IList<ElementId>
```

#### Return Value

IList ElementId
All the Cable Size ids that can be used by this Cable Type. See Also

#### Reference

CableType Class Autodesk.Revit.DB.Electrical Namespace